eisup_2019_docmng_integration/src/Enums/абс_СтатусыПереносДанных/абс_СтатусыПереносДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПереносДанных</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеГлавнымБухгалтеромДЗО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтеромКТТК</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>ВыполненПеренос</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетФормированиеДвижений</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетУдалениеДвижений</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеГлавнымБухгалтеромФилиала</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийФилиаизация/абс_ВидыОперацийФилиаизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийФилиаизация</name>
  <enumValues>
    <name>ВГР_ДЗО_КТТК</name>
  </enumValues>
  <enumValues>
    <name>ВГР_ДЗО_ДЗО</name>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
  </enumValues>
  <enumValues>
    <name>Рекласс</name>
  </enumValues>
  <enumValues>
    <name>ПереносДанных</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНоменклатуры/абс_СтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНоменклатуры</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласование</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыПрочихДоходовИРасходов/ВидыПрочихДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихДоходовИРасходов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ВозмещениеУбытковКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВИностранныхОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВРоссийскихОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделокОР</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСБезвозмезднымПолучениемИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСЛиквидациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСоСдачейИмуществаВАренду</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСПереоценкойВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейНематериальныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейОбъектовСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСУчастиемВДругихОрганизациях</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыСвязанныеСВосстановлениемАмортизационнойПремии</name>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницыПоРасчетамВУЕ</name>
    <comment>Курсовые разницы по расчетам в у.е.</comment>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НДСПоСписаннойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияВОценочныеРезервы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПремияПокупателю</name>
    <comment>Премия, выплаченная покупателю</comment>
  </enumValues>
  <enumValues>
    <name>ПрибыльУбытокПрошлыхЛет</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыНачисленныеПоСт269</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнереализационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКосвенныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаУслугиБанков</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыОтСниженияСтоимостиАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ШтрафыПениНеустойкиКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаПрибылиДоРыночныхЦен</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеУбыткиПриравненныеКВнереализационнымРасходам</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <comment>(Регл)</comment>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоБУ</registerRecords>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоНУ</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.абс_ЗатратыПоДоговорамСКонтролемЛимитов</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РучноеФормированиеОборотовБюджетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_БезКонтроляМаппинга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДоходыПрошлыхЛет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>уд_абс_ПериодОтражения</name>
    <type>
      <types>CatalogRef.ас_ПериодыОтражения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидОперацииФилиализация</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийФилиаизация</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СчетПереносаРекласс</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПриемник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КорректировкаЗаписейРегистров</name>
    <type>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РучноеРедактированиеПо6802</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_СчетаПереносаФилиализация</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборКонтрагентыВГР</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыРеклассификация</name>
    <attributes>
      <name>ДокументРеклассификациии</name>
      <type>
        <types>DocumentRef.ВозвратПереданныхТоваров</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/CommonModules/абс_Привилегированный/Module.bsl
Функция ВернутьЗапрос(Организация,НачПериода,КонПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Оператор,
	               |	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Субконто2) КАК ДоговорОператора,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток) КАК СальдоНаНачало,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт) КАК ОборотПоДт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт) КАК ОборотПоКт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток) КАК СальдоНаКонец
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, , , Счет = &СчетОператора, , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	               |	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Субконто2)
	               |ИТОГИ
	               |	СУММА(СальдоНаНачало),
	               |	СУММА(ОборотПоДт),
	               |	СУММА(ОборотПоКт),
	               |	СУММА(СальдоНаКонец)
	               |ПО
	               |	Оператор,
	               |	ДоговорОператора";
	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетОператора", ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.10.1"));
	
	Результат = Запрос.Выполнить();
	//Возврат Результат.Выгрузить();
	Возврат Результат;
КонецФункции

Функция ВыполнитьЗапрос(ТекстЗапроса,СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Для каждого Структура из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(Структура.Ключ,Структура.Значение);	
	КонецЦикла;	
	
	Возврат Запрос.Выполнить();		
	
КонецФункции

Функция СоздатьЗаказПокупателяДляПроектаБезКонтроляПрав(ПроектСсылка, ОрганизацияПроекта, ДатаДокумента) Экспорт
	
	//УстановитьПривилегированныйРежим(Истина); 
	
	ЕСли НЕ Константы.абс_ПроведениеПоМеханизмуПроектногоУчета.Получить() Тогда
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕСли;
	
	ПроектОбъект = ПроектСсылка.ПолучитьОбъект();
	
	НайденнаяСтрока = ПроектОбъект.абс_Заказы.Найти(ОрганизацияПроекта, "Организация");
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = ПроектОбъект.абс_Заказы.Добавить();
		НайденнаяСтрока.Организация = ОрганизацияПроекта;
	КонецЕсли;
	
	//создание документа "Заказ покупателя"
	ДокЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокЗаказ, "Продажа");
	Если ДатаДокумента = Неопределено Или ДатаДокумента = '0001-01-01' или ДатаДокумента = '0001-01-01-00-00-00' Тогда
		ДокЗаказ.Дата = ТекущаяДата();
	Иначе
		ДокЗаказ.Дата = ДатаДокумента;
	КонецЕсли;
	ДокЗаказ.Организация = ОрганизацияПроекта;
	ДокЗаказ.Проект = ПроектСсылка;
	Попытка  		
		ДокЗаказ.Записать(РежимЗаписиДокумента.Запись);		
	//	Сообщить("В базе данных создан документ: """+Строка(ДокЗаказ.Ссылка)+""" !", СтатусСообщения.Информация);
	Исключение
	//	Сообщить("Не удалось в базе данных создать документ заказ покупателя и установить его для данного проекта по данной организации, по причине: "+ОписаниеОшибки()+" !", СтатусСообщения.Внимание);
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецПопытки;
	
	НайденнаяСтрока.ЗаказПокупателя = ДокЗаказ.Ссылка;
	
	Попытка 
		ПроектОбъект.Записать();
	//	Сообщить("Созданный документ заказ покупателя установлен для данного проекта по данной организации!", СтатусСообщения.Информация);
		Возврат ДокЗаказ.Ссылка;
	Исключение
	//	Сообщить("Не удалось установить созданный документ заказ покупателя для данного проекта по данной организации!", СтатусСообщения.Внимание);
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецПопытки;
	
	//УстановитьПривилегированныйРежим(Ложь);	
	
КонецФункции	

Функция ПолучитьПользователейИнформационнойБазы() Экспорт   //АБС 19351
	
	Возврат  ПользователиИнформационнойБазы.ПолучитьПользователей();
	
КонецФункции

Процедура СформироватьНоменклатурныеГруппыИПроектыБезКонтроляПрав(СсылкаНаЗаявку) Экспорт  
	Документы.абс_ЗаявкаНаПроект.СформироватьНоменклатурныеГруппыИПроекты(СсылкаНаЗаявку);
КонецПроцедуры

//АБС ВСТАВКА 30.11.2014 Навценя

Процедура УдалитьДвиженияРегистратора(Ссылка, БлокироватьДляИзменения = Истина) Экспорт
	
	ИспользованныеРегистры = ПолучитьМассивИспользуемыхРегистров(Ссылка,  Ссылка.Метаданные().Движения);
	
	Для Каждого ИмяРегистра Из ИспользованныеРегистры Цикл
		
		НаборЗаписей = Неопределено;
		Блокировка = Истина;
		
		Если Метаданные.РегистрыНакопления.Найти(ИмяРегистра)<>Неопределено Тогда
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(ИмяРегистра)<>Неопределено Тогда
			НаборЗаписей = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
		ИначеЕсли Метаданные.РегистрыСведений.Найти(ИмяРегистра)<>Неопределено Тогда
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			Блокировка = Ложь;
		КонецЕсли;
		
		Если НаборЗаписей<>Неопределено Тогда
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			Если Блокировка Тогда
				НаборЗаписей.БлокироватьДляИзменения = БлокироватьДляИзменения;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура СоздатьДокументДвиженийОпераияБух(СтруктураПараметров) Экспорт
	
	СоздаватьДокумент = Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДокументДвиженийОпераияБух) Тогда
		СоздаватьДокумент = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДокументДвиженийОпераияБух) Тогда 
		Если СтруктураПараметров.ДокументДвиженийОпераияБух.ПолучитьОбъект() = Неопределено Тогда 
			СоздаватьДокумент = Истина;
		Иначе
			Если СтруктураПараметров.ДокументДвиженийОпераияБух.Организация <> СтруктураПараметров.Орг Тогда 
				СоздаватьДокумент = Истина;
			ИначеЕсли СтруктураПараметров.ДокументДвиженийОпераияБух.ПометкаУдаления <> СтруктураПараметров.ПометкаУдаления Тогда 
				СоздаватьДокумент = Истина;
			ИначеЕсли (СтруктураПараметров.ДокументДвиженийОпераияБух.Дата <> СтруктураПараметров.ДатаПереноса) И (СтруктураПараметров.Статус = Перечисления.абс_СтатусыПереносДанных.Подготовка) Тогда 
				СоздаватьДокумент = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Если НЕ СоздаватьДокумент Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДокументДвиженийОпераияБух) Тогда
		ДокументДвиженийОбъект = Документы.ОперацияБух.СоздатьДокумент();
	Иначе
		ДокументДвиженийОбъект = СтруктураПараметров.ДокументДвиженийОпераияБух.ПолучитьОбъект();
		Если ДокументДвиженийОбъект=Неопределено Тогда
			ДокументДвиженийОбъект = Документы.ОперацияБух.СоздатьДокумент();
		КонецЕсли;
	КонецЕсли;
	
	ДокументДвиженийОбъект.Организация = СтруктураПараметров.Орг;
	ДокументДвиженийОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	ДокументДвиженийОбъект.Содержание = Строка(СтруктураПараметров.НаправлениеПереноса);
	ДокументДвиженийОбъект.Комментарий = Строка(СтруктураПараметров.Операция); 
	ДокументДвиженийОбъект.ПометкаУдаления = СтруктураПараметров.ПометкаУдаления;
	ДокументДвиженийОбъект.абс_ВидОперацииФилиализация = Перечисления.абс_ВидыОперацийФилиаизация.ПереносДанных; 
	ДокументДвиженийОбъект.Дата = ?(СтруктураПараметров.ДатаПереноса = Неопределено, СтруктураПараметров.Дата, СтруктураПараметров.ДатаПереноса);
	ДокументДвиженийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	СтруктураПараметров.ДокументДвиженийОпераияБух = ДокументДвиженийОбъект.Ссылка;
	СтруктураПараметров.СоздаватьДокумент = СоздаватьДокумент;
	
КонецПроцедуры

Процедура ЗапонлитьСуммуОперацииБух(ДокументДвиженийОпераияБух) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументДвиженийОпераияБух) Тогда 
		Возврат;	
	КонецЕсли;
	
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументДвиженийОпераияБух);
    НаборЗаписей.Прочитать();
		
	Если НаборЗаписей.Количество() > 0 Тогда 	
		ДокументДвиженийОбъект = ДокументДвиженийОпераияБух.ПолучитьОбъект();
		ДокументДвиженийОбъект.СуммаОперации = НаборЗаписей.Итог("Сумма");
		ДокументДвиженийОбъект.ОбменДанными.Загрузка = Истина;
		ДокументДвиженийОбъект.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаПометкиУдаленияОперацияБух(ДокументДвиженийОпераияБух, ПометкаУдаления) Экспорт
	
	Если ЗначениеЗаполнено(ДокументДвиженийОпераияБух) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументДвиженийОбъект = ДокументДвиженийОпераияБух.ПолучитьОбъект();
	ДокументДвиженийОбъект.ПометкаУдаления = ПометкаУдаления;
	ДокументДвиженийОбъект.ОбменДанными.Загрузка = Истина;
	ДокументДвиженийОбъект.Записать();	
			
КонецПроцедуры

Процедура ОчиститьСуммуОперацииБух(ДокументДвиженийОпераияБух) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументДвиженийОпераияБух) Тогда 
		Возврат;	
	КонецЕсли;
			
	ДокументДвиженийОбъект = ДокументДвиженийОпераияБух.ПолучитьОбъект();
	ДокументДвиженийОбъект.СуммаОперации = 0;
	ДокументДвиженийОбъект.ОбменДанными.Загрузка = Истина;
	ДокументДвиженийОбъект.Записать();
	
КонецПроцедуры

//АБС ВСТАВКА КОНЕЦ

//АБС ВСТАВКА 55879  16.02.2015 10:50:49  Шамов
Функция СоздатьПрочиеДоходыРасходы(Наименование, Родитель) Экспорт
	врОбъект = Справочники.ПрочиеДоходыИРасходы.СоздатьЭлемент();
	врОбъект.Родитель = Родитель;
	врОбъект.абс_Статус = Перечисления.абс_СтатусыНоменклатуры.Использование;
	врОбъект.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет;
	врОбъект.абс_Ответственный = ПараметрыСеанса.ТекущийПользователь;
	врОбъект.Наименование = Наименование;
	врОбъект.абс_Комментарий = "#Автоматическое создание#";
	врОбъект.Записать();   
	Возврат врОбъект.Ссылка;
КонецФункции
//АБС ВСТАВКА 55879 КОНЕЦ
